[
    {
        "thumbnail": {
            "light": "/driveX_logo.webp",
            "dark": "/driveX_logo.webp"
        },
        "title": "DriveX",
        "link": {
            "label": "DriveX",
            "url": "https://drivex-iota.vercel.app/sign-in"
        },
        "description": "DriveX is a modern cloud storage app inspired by Google Drive, offering user authentication, smart file organization, quick search, recent activity tracking, support for uploading, previewing, downloading, and sharing files (images, videos, audio, PDFs), up to 2GB of secure data storage per user, and a responsive interface with a chart that visualizes remaining storage space.",
        "languageIcons": [
            "/nextjs_icon.jpeg",
            "/ts_icon.png",
            "/css_icon.png",
            "/shadcn_icon.png",
            "/appwrite_icon.png"
        ]
    },
    {
        "thumbnail": {
            "light": "/neoNft_logo_light.png",
            "dark": "/neoNft_logo.png"
        },
        "title": "NeoNft",
        "link": {
            "label": "NeoNft",
            "url": "https://neo-nft.vercel.app/"
        },
        "description": "NeoNFT is a full-stack NFT platform where users can mint, list, buy, and manage NFTs. It features a custom marketplace built with Solidity smart contracts and a frontend built using Next.js, Tailwind CSS, and RainbowKit for wallet integration. Users can explore NFTs, view their assets, and interact seamlessly with the blockchain.",
        "languageIcons": [
            "/nextjs_icon.jpeg",
            "/js_icon.png",
            "/css_icon.png",
            "/sol_icon.png",
            "/wagmi_icon.png",
            "/rainbowkit_icon.png",
            "/fm_icon.webp"
        ]
    },
    {
        "thumbnail": {
            "light": "/lootbox_logo.png",
            "dark": "/lootbox_logo.png"
        },
        "title": "LootBox",
        "link": {
            "label": "LootBox",
            "url": "https://lootbox-virid.vercel.app/"
        },
        "description": "LootBox is a Web3 application that lets users create, open, and claim rewards from loot boxes. It features two smart contracts: one for mintable reward tokens and another for managing loot box logic. The frontend, built with Next.js and Tailwind CSS, includes pages to view available loot boxes, claim rewards, and create new boxes with custom token inputs. Wallet integration via RainbowKit and WAGMI allows seamless blockchain interaction, with smooth UI animations powered by Framer Motion",
        "languageIcons": [
            "/nextjs_icon.jpeg",
            "/ts_icon.png",
            "/css_icon.png",
            "/sol_icon.png",
            "/wagmi_icon.png",
            "/rainbowkit_icon.png",
            "/fm_icon.webp"
        ]
    }
]